todo-app/app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-11-18 15:41:54.152033"], ["name", "New List"], ["updated_at", "2014-11-18 15:41:54.152033"]]