todo-app/app/controllers/tasks_controller.rb

SELECT  "lists".* FROM "lists"  WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "tasks" ("created_at", "description", "list_id", "priority", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-18 16:04:33.040351"], ["description", "do things"], ["list_id", 1], ["priority", "very important"], ["updated_at", "2014-11-18 16:04:33.040351"]]
---
  def create
    @list = List.find(params[:list_id])
    @task = @list.tasks.build(task_params)

    if @task.save

SELECT  "lists".* FROM "lists"  WHERE "lists"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."list_id" = ? AND "tasks"."id" = ? LIMIT 1  [["list_id", 1], ["id", 59]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 50]]
---
  def destroy
    @list = List.find(params[:list_id])
    @task = @list.tasks.find(params[:id])
    @task.destroy